print(5+5) #print 5+5 როდესაც დავწერე დავუშვი შეცდომა რდგან მე არ დავწერე ფრჩხილები მაგრამ როდესაც მივუწერე კომპიუტერს მივუთითე ფრჩხოლებით რომ მივუთითოდ კომპიუტერს თუ რა ნივუწეროთ.

# როდესაც ეს კოდი დავწერე mood = good და print(mood) error გამომიტანა რადგან როდესაც ცვლადი შევქმენი ცვლადის მნიშვნელობად შევიყვანე mood და mood არის სტრინგი და მე ბრჭყალები არ მიმიწერია რომ მიმენიჭებინა სტრინგი.
mood = "good"
print(mood) 

#როდესაც კოდი ჩავწერე print(device) და device = pc გამომიყვანა შეცდომა რადგან კომპიუტერი კოდებს ზემოდან ქვემოთ კითხულობს და როგორც კი ბაგი აღმოაჩინა ცვლადი აღარ წაუკითხია.
device = "pc"
print(device)

#როდესაც ჩავწერე კოდი print("Python) გამომივიდა ბაგი რადგან მე დამავიწყდა Python-ზე მერო ბრჭყალის მიწერა და გამოვასწორე
print("Python")

#როდესაც შევქმენი ცვლადი dog#name = "bella" გამომივიდა შეცდომა რადგან #-ის ნაცვლად უნდა მიმეწერა "_" რომ სწორად გამომსვლოდა და გამოვასწორე.
dog_name = "bella"
print("bella")

#ჩვენ კომენტარები გვეხმარება იმისთვის რომ მარტივად ამოვიკითხოთ მაგალითად ამ კონკრეტულ კოდზე რას ვაკეთებდით. და ცვლადები იმისთვის რომ შევინახოდ ნებისმიერი მონაცემები ერთ ცვლადში მაგალითად name = nodo.